Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: وإني كلما دعوتهم لتغفر لهم جعلوا أصابعهم في آذانهم واستغشوا ثيابهم وأصروا واستكبروا استكبارا
en: And verily, every time I called unto them that You might forgive them, they thrust their fingers into their ears, covered themselves up with their garments, and persisted (in their refusal), and magnified themselves in pride.

source: ثم إني دعوتهم جهارا
en: "Then verily, I called to them openly (aloud).

source: ثم إني أعلنت لهم وأسررت لهم إسرارا
en: "Then verily, I proclaimed to them in public, and I have appealed to them in private.

source: فقلت استغفروا ربكم إنه كان غفارا
en: "I said (to them): 'Ask forgiveness from your Lord, verily, He is Oft-Forgiving;

source: يرسل السماء عليكم مدرارا
en: 'He will send rain to you in abundance,

source: ويمددكم بأموال وبنين ويجعل لكم جنات ويجعل لكم أنهارا
en: 'And give you increase in wealth and children, and bestow on you gardens and bestow on you rivers.'"

source: ما لكم لا ترجون لله وقارا
en: What is the matter with you, that [you fear not Allah (His punishment), and] you hope not for reward (from Allah or you believe not in His Oneness).

source: وقد خلقكم أطوارا
en: While He has created you in (different) stages [i.e. first Nutfah, then 'Alaqah and then Mudghah, see (V.23:13,14)].

source: ألم تروا كيف خلق الله سبع سماوات طباقا
en: See you not how Allah has created the seven heavens one above another?

source: وجعل القمر فيهن نورا وجعل الشمس سراجا
en: And has made the moon a light therein, and made the sun a lamp?

source: والله أنبتكم من الأرض نباتا
en: And Allah has brought you forth from the (dust of) earth? (Tafsir At-Tabari)

source: ثم يعيدكم فيها ويخرجكم إخراجا
en: Afterwards He will return you into it (the earth), and bring you forth (again on the Day of Resurrection)?

source: والله جعل لكم الأرض بساطا
en: And Allah has made for you the earth a wide expanse.

source: لتسلكوا منها سبلا فجاجا
en: That you may go about therein in broad roads.

source: قال نوح رب إنهم عصوني واتبعوا من لم يزده ماله وولده إلا خسارا
en: Nuh (Noah) said: "My Lord! They have disobeyed me, and followed one whose wealth and children give him no increase but loss.

source: ومكروا مكرا كبارا
en: "And they have plotted a mighty plot.

source: وقالوا لا تذرن آلهتكم ولا تذرن ودا ولا سواعا ولا يغوث ويعوق ونسرا
en: "And they have said: 'You shall not leave your gods: nor shall you leave Wadd, nor Suwa', nor Yaghuth, nor Ya'uq nor Nasr' (these are the names of their idols).

source: وقد أضلوا كثيرا ولا تزد الظالمين إلا ضلالا
en: "And indeed they have led many astray. And (O Allah): 'Grant no increase to the Zalimun (polytheists, wrong-doers, and disbelievers) save error.'"

source: مما خطيئاتهم أغرقوا فأدخلوا نارا فلم يجدوا لهم من دون الله أنصارا
en: Because of their sins they were drowned, then were made to enter the Fire. And they found none to help them instead of Allah.

source: وقال نوح رب لا تذر على الأرض من الكافرين ديارا
en: And Nuh (Noah) said: "My Lord! Leave not one of the disbelievers on the earth!

source: إنك إن تذرهم يضلوا عبادك ولا يلدوا إلا فاجرا كفارا
en: "If You leave them, they will mislead Your slaves, and they will beget none but wicked disbelievers.

source: رب اغفر لي ولوالدي ولمن دخل بيتي مؤمنا وللمؤمنين والمؤمنات ولا تزد الظالمين إلا تبارا
en: "My Lord! Forgive me, and my parents, and him who enters my home as a believer, and all the believing men and women. And to the Zalimun (polytheists, wrong-doers, and disbelievers) grant You no increase but destruction!"

source: قل أوحي إلي أنه استمع نفر من الجن فقالوا إنا سمعنا قرآنا عجبا
en: Say (O Muhammad صلى الله عليه وسلم): "It has been revealed to me that a group (from three to ten in number) of jinn listened (to this Qur'an). They said: 'Verily, we have heard a wonderful Recitation (this Qur'an)!

source: يهدي إلى الرشد فآمنا به ولن نشرك بربنا أحدا
en: 'It guides to the Right Path, and we have believed therein, and we shall never join (in worship) anything with our Lord (Allah).

source: وأنه تعالى جد ربنا ما اتخذ صاحبة ولا ولدا
en: 'And He, exalted be the Majesty of our Lord, has taken neither a wife nor a son (or offspring or children).

source: وأنه كان يقول سفيهنا على الله شططا
en: 'And that the foolish among us [i.e. Iblis (Satan) or the polytheists amongst the jinn] used to utter against Allah that which was an enormity in falsehood.

source: وأنا ظننا أن لن تقول الإنس والجن على الله كذبا
en: 'And verily, we thought that men and jinn would not utter a lie against Allah.

source: وأنه كان رجال من الإنس يعوذون برجال من الجن فزادوهم رهقا
en: 'And verily, there were men among mankind who took shelter with the males among the jinn, but they (jinn) increased them (mankind) in sin and transgression.

source: وأنهم ظنوا كما ظننتم أن لن يبعث الله أحدا
en: 'And they thought as you thought, that Allah will not send any Messenger (to mankind or jinn).

source: وأنا لمسنا السماء فوجدناها ملئت حرسا شديدا وشهبا
en: 'And we have sought to reach the heaven; but found it filled with stern guards and flaming fires.

source: وأنا كنا نقعد منها مقاعد للسمع فمن يستمع الآن يجد له شهابا رصدا
en: 'And verily, we used to sit there in stations, to (steal) a hearing, but any who listens now will find a flaming fire watching him in ambush.

source: وأنا لا ندري أشر أريد بمن في الأرض أم أراد بهم ربهم رشدا
en: 'And we know not whether evil is intended for those on earth, or whether their Lord intends for them a Right Path.

source: وأنا منا الصالحون ومنا دون ذلك كنا طرائق قددا
en: 'There are among us some that are righteous, and some the contrary; we are groups having different ways (religious sects).

source: وأنا ظننا أن لن نعجز الله في الأرض ولن نعجزه هربا
en: 'And we think that we cannot escape (the punishment of) Allah in the earth, nor can we escape Him by flight.

source: وأنا لما سمعنا الهدى آمنا به فمن يؤمن بربه فلا يخاف بخسا ولا رهقا
en: 'And indeed when we heard the Guidance (this Qur'an), we believed therein (Islamic Monotheism), and whosoever believes in his Lord shall have no fear, either of a decrease in the reward of his good deeds or an increase in the punishment for his sins.

source: وأنا منا المسلمون ومنا القاسطون فمن أسلم فأولئك تحروا رشدا
en: 'And of us some are Muslims (who have submitted to Allah, after listening to this Qur'an), and of us some are Al-Qasitun (disbelievers - those who have deviated from the Right Path)'. And whosoever has embraced Islam (i.e. has become a Muslim by submitting to Allah), then such have sought the Right Path."

source: وأما القاسطون فكانوا لجهنم حطبا
en: And as for the Qasitun (disbelievers who deviated from the Right Path), they shall be firewood for Hell,

source: وأن لو استقاموا على الطريقة لأسقيناهم ماء غدقا
en: If they (non-Muslims) had believed in Allah, and went on the Right Way (i.e. Islam) We would surely have bestowed on them water (rain) in abundance.

source: لنفتنهم فيه ومن يعرض عن ذكر ربه يسلكه عذابا صعدا
en: That We might try them thereby. And whosoever turns away from the Reminder of his Lord (i.e. this Qur'an, - and practise not its laws and orders), He will cause him to enter in a severe torment (i.e. Hell).

source: وأن المساجد لله فلا تدعوا مع الله أحدا
en: And the mosques are for Allah (Alone): so invoke not anyone along with Allah.

source: وأنه لما قام عبد الله يدعوه كادوا يكونون عليه لبدا
en: And when the slave of Allah (Muhammad صلى الله عليه وسلم) stood up invoking Him (his Lord - Allah) in prayer they (the jinn) just made round him a dense crowd as if sticking one over the other (in order to listen to the Prophet's recitation).

source: قل إنما أدعو ربي ولا أشرك به أحدا
en: Say (O Muhammad صلى الله عليه وسلم): "I invoke only my Lord (Allah Alone), and I associate none as partners along with Him."

source: قل إني لا أملك لكم ضرا ولا رشدا
en: Say: "It is not in my power to cause you harm, or to bring you to the Right Path."

source: قل إني لن يجيرني من الله أحد ولن أجد من دونه ملتحدا
en: Say (O Muhammad صلى الله عليه وسلم): "None can protect me from Allah's punishment (if I were to disobey Him), nor can I find refuge except in Him.

source: إلا بلاغا من الله ورسالاته ومن يعص الله ورسوله فإن له نار جهنم خالدين فيها أبدا
en: "(Mine is) but conveyance (of the truth) from Allah and His Messages (of Islamic Monotheism), and whosoever disobeys Allah and His Messenger, then Verily, for him is the Fire of Hell, he shall dwell therein forever."

source: حتى إذا رأوا ما يوعدون فسيعلمون من أضعف ناصرا وأقل عددا
en: Till, when they see that which they are promised, then they will know who it is that is weaker concerning helpers and less important concerning numbers.

source: قل إن أدري أقريب ما توعدون أم يجعل له ربي أمدا
en: Say (O Muhammad صلى الله عليه وسلم): "I know not whether (the punishment) which you are promised is near or whether my Lord will appoint for it a distant term.

source: عالم الغيب فلا يظهر على غيبه أحدا
en: "(He Alone is) the All-Knower of the Ghaib (Unseen), and He reveals to none His Ghaib (Unseen)."

source: إلا من ارتضى من رسول فإنه يسلك من بين يديه ومن خلفه رصدا
en: Except to a Messenger (from mankind) whom He has chosen (He informs him of unseen as much as He likes), and then He makes a band of watching guards (angels) to march before him and behind him.

source: ليعلم أن قد أبلغوا رسالات ربهم وأحاط بما لديهم وأحصى كل شيء عددا
en: [He (Allah) protects them (the Messengers)], till He sees that they (the Messengers) have conveyed the Messages of their Lord (Allah). And He (Allah) surrounds all that which is with them, and He (Allah) keeps count of all things (i.e. He knows the exact number of everything).

source: يا أيها المزمل
en: O you wrapped in garments (i.e. Prophet Muhammad صلى الله عليه وسلم)!

source: قم الليل إلا قليلا
en: Stand (to pray) all night, except a little -

source: نصفه أو انقص منه قليلا
en: Half of it or a little less than that,

source: أو زد عليه ورتل القرآن ترتيلا
en: Or a little more. And recite the Qur'an (aloud) in a slow, (pleasant tone and) style.

source: إنا سنلقي عليك قولا ثقيلا
en: Verily, We shall send down to you a weighty Word (i.e. obligations, laws).

source: إن ناشئة الليل هي أشد وطئا وأقوم قيلا
en: Verily, the rising by night (for Tahajjud prayer) is very hard and most potent and good for governing oneself, and most suitable for (understanding) the Word (of Allah).

source: إن لك في النهار سبحا طويلا
en: Verily, there is for you by day prolonged occupation with ordinary duties.

source: واذكر اسم ربك وتبتل إليه تبتيلا
en: And remember the Name of your Lord and devote yourself to Him with a complete devotion.

source: رب المشرق والمغرب لا إله إلا هو فاتخذه وكيلا
en: (He Alone is) the Lord of the east and the west; La ilaha illa Huwa (none has the right to be worshipped but He). So take Him Alone as Wakil (Disposer of your affairs).

source: واصبر على ما يقولون واهجرهم هجرا جميلا
en: And be patient (O Muhammad صلى الله عليه وسلم) with what they say, and keep away from them in a good way.

source: وذرني والمكذبين أولي النعمة ومهلهم قليلا
en: And leave Me Alone to deal with the beliers (those who deny My Verses), those who are in possession of good things of life. And give them respite for a little while.

source: إن لدينا أنكالا وجحيما
en: Verily, with Us are fetters (to bind them), and a raging Fire.

source: وطعاما ذا غصة وعذابا أليما
en: And a food that chokes, and a painful torment.

source: يوم ترجف الأرض والجبال وكانت الجبال كثيبا مهيلا
en: On the Day when the earth and the mountains will be in violent shake, and the mountains will be a heap of sand poured out.

source: إنا أرسلنا إليكم رسولا شاهدا عليكم كما أرسلنا إلى فرعون رسولا
en: Verily, We have sent to you (O men) a Messenger (Muhammad صلى الله عليه وسلم) to be a witness over you, as We did send a Messenger [Musa (Moses)] to Fir'aun (Pharaoh).

source: فعصى فرعون الرسول فأخذناه أخذا وبيلا
en: But Fir'aun (Pharaoh) disobeyed the Messenger [Musa (Moses)]; so We seized him with a severe punishment.

source: فكيف تتقون إن كفرتم يوما يجعل الولدان شيبا
en: Then how can you avoid the punishment, if you disbelieve, on a Day (i.e. the Day of Resurrection) that will make the children grey-headed?

source: السماء منفطر به كان وعده مفعولا
en: Whereon the heaven will be cleft asunder? His Promise is certainly to be accomplished.

source: إن هذه تذكرة فمن شاء اتخذ إلى ربه سبيلا
en: Verily, this is an admonition: therefore whosoever will, let him take a Path to His Lord!

source: إن ربك يعلم أنك تقوم أدنى من ثلثي الليل ونصفه وثلثه وطائفة من الذين معك والله يقدر الليل والنهار علم أن لن تحصوه فتاب عليكم فاقرءوا ما تيسر من القرآن علم أن سيكون منكم مرضى وآخرون يضربون في الأرض يبتغون من فضل الله وآخرون يقاتلون في سبيل الله فاقرءوا ما تيسر منه وأقيموا الصلاة وآتوا الزكاة وأقرضوا الله قرضا حسنا وما تقدموا لأنفسكم من خير تجدوه عند الله هو خيرا وأعظم أجرا واستغفروا الله إن الله غفور رحيم
en: Verily, your Lord knows that you do stand (to pray at night) a little less than two thirds of the night, or half the night, or a third of the night, and also a party of those with you. And Allah measures the night and the day. He knows that you are unable to pray the whole night, so He has turned to you (in mercy). So, recite you of the Qur'an as much as may be easy for you. He knows that there will be some among you sick, others travelling through the land, seeking of Allah's Bounty, yet others fighting in Allah's Cause. So recite as much of the Qur'an as may be easy (for you), and perform As-Salat (Iqamat-as-Salat ) and give Zakat, and lend to Allah a goodly loan. And whatever good you send before you for yourselves (i.e. Nawafil non-obligatory acts of worship: prayers, charity, fasting, Hajj and 'Umrah), you will certainly find it with Allah, better and greater in reward. And seek Forgiveness of Allah. Verily, Allah is Oft-Forgiving, Most-Merciful .

source: يا أيها المدثر
en: O you (Muhammad صلى الله عليه وسلم) enveloped in garments!

source: قم فأنذر
en: Arise and warn!

source: وربك فكبر
en: And magnify your Lord (Allah)!

source: وثيابك فطهر
en: And purify your garments!

source: والرجز فاهجر
en: And keep away from Ar-Rujz (the idols)!

source: ولا تمنن تستكثر
en: And give not a thing in order to have more (or consider not your deeds of obedience to Allah as a favour to Him).

source: ولربك فاصبر
en: And be patient for the sake of your Lord (i.e. perform your duty to Allah)!

source: فإذا نقر في الناقور
en: Then, when the Trumpet is sounded (i.e. the second blowing of the horn).

source: فذلك يومئذ يوم عسير
en: Truly, that Day will be a Hard Day -

source: على الكافرين غير يسير
en: Far from easy for the disbelievers.

source: ذرني ومن خلقت وحيدا
en: Leave Me Alone (to deal) with whom I created lonely (without any wealth or children etc, i.e. Al-Walid bin Al-Mughirah Al-Makhzumi)!

source: وجعلت له مالا ممدودا
en: And then granted him resources in abundance.

source: وبنين شهودا
en: And children to be by his side.

source: ومهدت له تمهيدا
en: And made life smooth and comfortable for him.

source: ثم يطمع أن أزيد
en: After all that he desires that I should give more;

source: كلا إنه كان لآياتنا عنيدا
en: Nay! Verily, he has been opposing Our Ayat (proofs, evidence, verses, lessons, signs, revelations).

source: سأرهقه صعودا
en: I shall oblige him to (climb a slippery mountain in the Hell-fire called As-Sa'ud, or) face a severe torment!

source: إنه فكر وقدر
en: Verily, he thought and plotted.

source: فقتل كيف قدر
en: So let him be cursed: how he plotted!

source: ثم قتل كيف قدر
en: And once more let him be cursed: how he plotted!

source: ثم نظر
en: Then he thought.

source: ثم عبس وبسر
en: Then he frowned and he looked in a bad tempered way;

source: ثم أدبر واستكبر
en: Then he turned back, and was proud.

source: فقال إن هذا إلا سحر يؤثر
en: Then he said: "This is nothing but magic from that of old,

source: إن هذا إلا قول البشر
en: "This is nothing but the word of a human being!"

source: سأصليه سقر
en: I will cast him into Hell-fire.

source: وما أدراك ما سقر
en: And what will make you know (exactly) what Hell-fire is?

source: لا تبقي ولا تذر
en: It spares not (any sinner), nor does it leave (anything unburnt)!

source: لواحة للبشر
en: Burning and blackening the skins!

source: عليها تسعة عشر
en: Over it are nineteen (angels as guardians and keepers of Hell).

source: وما جعلنا أصحاب النار إلا ملائكة وما جعلنا عدتهم إلا فتنة للذين كفروا ليستيقن الذين أوتوا الكتاب ويزداد الذين آمنوا إيمانا ولا يرتاب الذين أوتوا الكتاب والمؤمنون وليقول الذين في قلوبهم مرض والكافرون ماذا أراد الله بهذا مثلا كذلك يضل الله من يشاء ويهدي من يشاء وما يعلم جنود ربك إلا هو وما هي إلا ذكرى للبشر
en: And We have set none but angels as guardians of the Fire. And We have fixed their number (19) only as a trial for the disbelievers, in order that the people of the Scripture (Jews and Christians) may arrive at a certainty [that this Qur'an is the truth as it agrees with their Books regarding the number (19) which is written in the Taurat (Torah) and the Injeel (Gospel)] and that the believers may increase in Faith (as this Qur'an is the truth), and that no doubt may be left for the people of the Scripture and the believers, and that those in whose hearts is a disease (of hypocrisy) and the disbelievers may say: "What Allah intends by this (curious) example ?" Thus Allah leads astray whom He wills and guides whom He wills. And none can know the hosts of your Lord but He. And this (Hell) is nothing else than a (warning) reminder to mankind.

source: كلا والقمر
en: Nay! And by the moon

source: والليل إذ أدبر
en: And by the night when it withdraws.

source: والصبح إذا أسفر
en: And by the dawn when it brightens.

source: إنها لإحدى الكبر
en: Verily, it (Hell, or their denial of Prophet Muhammad صلى الله عليه وسلم, or the Day of Resurrection) is but one of the greatest (signs).

source: نذيرا للبشر
en: A warning to mankind -

source: لمن شاء منكم أن يتقدم أو يتأخر
en: To any of you that chooses to go forward (by working righteous deeds), or to remain behind (by committing sins).

source: كل نفس بما كسبت رهينة
en: Every person is a pledge for what he has earned,

source: إلا أصحاب اليمين
en: Except those on the Right, (i.e. the pious true believers of Islamic Monotheism).

source: في جنات يتساءلون
en: In Gardens (Paradise) they will ask one another,

source: عن المجرمين
en: About Al-Mujrimun (polytheists, criminals, disbelievers), (And they will say to them):

source: ما سلككم في سقر
en: "What has caused you to enter Hell?"

source: قالوا لم نك من المصلين
en: They will say: "We were not of those who used to offer the Salat (prayers),

source: ولم نك نطعم المسكين
en: "Nor we used to feed Al-Miskin (the poor);

source: وكنا نخوض مع الخائضين
en: "And we used to talk falsehood (all that which Allah hated) with vain talkers.

source: وكنا نكذب بيوم الدين
en: And we used to belie the Day of Recompense,

source: حتى أتانا اليقين
en: "Until there came to us (the death) that is certain."

source: فما تنفعهم شفاعة الشافعين
en: So no intercession of intercessors will be of any use to them.

source: فما لهم عن التذكرة معرضين
en: Then what is wrong with them (i.e. the polytheists, the disbelievers) that they turn away from (receiving) admonition?

source: كأنهم حمر مستنفرة
en: As if they were (frightened) wild donkeys.

source: فرت من قسورة
en: Fleeing from a hunter, or a lion, or a beast of prey.

source: بل يريد كل امرئ منهم أن يؤتى صحفا منشرة
en: Nay, everyone of them desires that he should be given pages spread out (coming from Allah with a writing that Islam is the right religion, and Muhammad صلى الله عليه وسلم has come with the truth from Allah, the Lord of the heavens and earth).

source: كلا بل لا يخافون الآخرة
en: Nay! But they fear not the Hereafter (from Allah's punishment).

source: كلا إنه تذكرة
en: Nay, verily, this (Qur'an) is an admonition,

source: فمن شاء ذكره
en: So whosoever will (let him read it), and receive admonition (from it)!

source: وما يذكرون إلا أن يشاء الله هو أهل التقوى وأهل المغفرة
en: And they will not receive admonition unless Allah wills; He (Allah) is the One, deserving that mankind should be afraid of, and should be dutiful to Him, and should not take any Ilah (god) along with Him, and He is the One Who forgives (sins).

source: لا أقسم بيوم القيامة
en: I swear by the Day of Resurrection.

source: ولا أقسم بالنفس اللوامة
en: And I swear by the self-reproaching person (a believer).

source: أيحسب الإنسان ألن نجمع عظامه
en: Does man (a disbeliever) think that We shall not assemble his bones?

source: بلى قادرين على أن نسوي بنانه
en: Yes, We are Able to put together in perfect order the tips of his fingers.

source: بل يريد الإنسان ليفجر أمامه
en: Nay! Man (denies Resurrection and Reckoning. So he) desires to continue committing sins.

source: يسأل أيان يوم القيامة
en: He asks: "When will be this Day of Resurrection?"

source: فإذا برق البصر
en: So, when the sight shall be dazed.

source: وخسف القمر
en: And the moon will be eclipsed.

source: وجمع الشمس والقمر
en: And the sun and moon will be joined together (by going one into the other or folded up or deprived of their light).

source: يقول الإنسان يومئذ أين المفر
en: On that Day man will say: "Where (is the refuge) to flee?"

source: كلا لا وزر
en: No! There is no refuge!

source: إلى ربك يومئذ المستقر
en: Unto your Lord (Alone) will be the place of rest that Day.

source: ينبأ الإنسان يومئذ بما قدم وأخر
en: On that Day man will be informed of what he sent forward (of his evil good deeds), and what he left behind (of his good or evil traditions).

source: بل الإنسان على نفسه بصيرة
en: Nay! Man will be a witness against himself [as his body parts (skin, hands, legs, etc.) will speak about his deeds],

source: ولو ألقى معاذيره
en: Though he may put forth his excuses (to cover his evil deeds).

source: لا تحرك به لسانك لتعجل به
en: Move not your tongue concerning (the Qur'an, O Muhammad صلى الله عليه وسلم) to make haste therewith.

source: إن علينا جمعه وقرآنه
en: It is for Us to collect it and to give you (O Muhammad صلى الله عليه وسلم) the ability to recite it (the Qur'an).

source: فإذا قرأناه فاتبع قرآنه
en: And when We have recited it to you [O Muhammad صلى الله عليه وسلم through Jibril (Gabriel)], then follow its (the Qur'an's) recital.

source: ثم إن علينا بيانه
en: Then it is for Us (Allah) to make it clear (to you).

source: كلا بل تحبون العاجلة
en: Not [as you think, that you (mankind) will not be resurrected and recompensed for your deeds], but you (men) love the present life of this world,

source: وتذرون الآخرة
en: And neglect the Hereafter.

source: وجوه يومئذ ناضرة
en: Some faces that Day shall be Nadirah (shining and radiant).

source: إلى ربها ناظرة
en: Looking at their Lord (Allah).

source: ووجوه يومئذ باسرة
en: And some faces, that Day, will be Basirah (dark, gloomy, frowning, and sad),

source: تظن أن يفعل بها فاقرة
en: Thinking that some calamity is about to fall on them.

source: كلا إذا بلغت التراقي
en: Nay, when (the soul) reaches to the collar bone (i.e. up to the throat in its exit),

source: وقيل من راق
en: And it will be said: "Who can cure him (and save him from death)?"

source: وظن أنه الفراق
en: And he (the dying person) will conclude that it was (the time) of parting (death);

source: والتفت الساق بالساق
en: And one leg will be joined with another leg (shrouded).

source: إلى ربك يومئذ المساق
en: The drive will be, on that Day, to your Lord (Allah)!

source: فلا صدق ولا صلى
en: So he (the disbeliever) neither believed (in this Qur'an and in the Message of Muhammad صلى الله عليه وسلم) nor prayed!

source: ولكن كذب وتولى
en: But on the contrary, he belied (this Qur'an and the Message of Muhammad صلى الله عليه وسلم) and turned away!

source: ثم ذهب إلى أهله يتمطى
en: Then he walked in conceit (full pride) to his family admiring himself!

source: أولى لك فأولى
en: Woe to you [O man (disbeliever)]! And then (again) woe to you!
